---
kind: property
id: P:Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsEndConnectorPresent
source: html/1527f49a-54f5-4a52-cefc-a47d01dda2c9.htm
---
# Autodesk.Revit.DB.Structure.RebarShapeMultiplanarDefinition.IsEndConnectorPresent Property

Whether a perpendicular segment is constructed
 from the end of the 2D shape.

## Syntax (C#)
```csharp
public bool IsEndConnectorPresent { get; }
```